lichengxiang0/LPC54628_test/board/pin_mux.h
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/* add test defined */
void BOARDInitSDCard(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#define PIO04_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO05_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO05_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO06_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO06_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO11_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO11_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_6 (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
#define BOARD_SW2_PERIPHERAL GPIO                                  /*!<@brief Device name: GPIO */
#define BOARD_SW2_SIGNAL PIO0                                      /*!<@brief GPIO signal: PIO0 */
#define BOARD_SW2_GPIO GPIO                                        /*!<@brief GPIO device name: GPIO */
#define BOARD_SW2_GPIO_PIN 6U                                      /*!<@brief PIO0 pin index: 6 */
#define BOARD_SW2_PORT 0U                                          /*!<@brief PORT device name: 0U */
#define BOARD_SW2_PIN 6U                                           /*!<@brief 0U pin index: 6 */
#define BOARD_SW2_CHANNEL 6                                        /*!<@brief GPIO PIO0 channel: 6 */
#define BOARD_SW2_PIN_NAME PIO0_6                                  /*!<@brief Pin name */
#define BOARD_SW2_LABEL "U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4" /*!<@brief Label */
#define BOARD_SW2_NAME "SW2"                                       /*!<@brief Identifier name */
#define BOARD_SW2_DIRECTION kPIN_MUX_DirectionInput                /*!<@brief Direction */
                                                                   /* @} */

/*! @name PIO0_5 (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
/*!
 * @brief Device name: GPIO */
#define BOARD_SW3_PERIPHERAL GPIO
/*!
 * @brief GPIO signal: PIO0 */
#define BOARD_SW3_SIGNAL PIO0
/*!
 * @brief GPIO device name: GPIO */
#define BOARD_SW3_GPIO GPIO
/*!
 * @brief PIO0 pin index: 5 */
#define BOARD_SW3_GPIO_PIN 5U
/*!
 * @brief PORT device name: 0U */
#define BOARD_SW3_PORT 0U
/*!
 * @brief 0U pin index: 5 */
#define BOARD_SW3_PIN 5U
/*!
 * @brief GPIO PIO0 channel: 5 */
#define BOARD_SW3_CHANNEL 5
/*!
 * @brief Pin name */
#define BOARD_SW3_PIN_NAME PIO0_5
/*!
 * @brief Label */
#define BOARD_SW3_LABEL "U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3"
/*!
 * @brief Identifier name */
#define BOARD_SW3_NAME "SW3"
/*!
 * @brief Direction */
#define BOARD_SW3_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PIO0_4 (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
/*!
 * @brief Device name: GPIO */
#define BOARD_SW4_PERIPHERAL GPIO
/*!
 * @brief GPIO signal: PIO0 */
#define BOARD_SW4_SIGNAL PIO0
/*!
 * @brief GPIO device name: GPIO */
#define BOARD_SW4_GPIO GPIO
/*!
 * @brief PIO0 pin index: 4 */
#define BOARD_SW4_GPIO_PIN 4U
/*!
 * @brief PORT device name: 0U */
#define BOARD_SW4_PORT 0U
/*!
 * @brief 0U pin index: 4 */
#define BOARD_SW4_PIN 4U
/*!
 * @brief GPIO PIO0 channel: 4 */
#define BOARD_SW4_CHANNEL 4
/*!
 * @brief Pin name */
#define BOARD_SW4_PIN_NAME PIO0_4
/*!
 * @brief Label */
#define BOARD_SW4_LABEL "U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2"
/*!
 * @brief Identifier name */
#define BOARD_SW4_NAME "SW4"
/*!
 * @brief Direction */
#define BOARD_SW4_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PIO1_1 (coord K12), J12[12]/U29[4]/SW5/P1_1-USER_PB-USB1_OVRCURn
  @{ */
#define BOARD_SW5_PERIPHERAL GPIO                                      /*!<@brief Device name: GPIO */
#define BOARD_SW5_SIGNAL PIO1                                          /*!<@brief GPIO signal: PIO1 */
#define BOARD_SW5_GPIO GPIO                                            /*!<@brief GPIO device name: GPIO */
#define BOARD_SW5_GPIO_PIN 1U                                          /*!<@brief PIO1 pin index: 1 */
#define BOARD_SW5_PORT 1U                                              /*!<@brief PORT device name: 1U */
#define BOARD_SW5_PIN 1U                                               /*!<@brief 1U pin index: 1 */
#define BOARD_SW5_CHANNEL 1                                            /*!<@brief GPIO PIO1 channel: 1 */
#define BOARD_SW5_PIN_NAME PIO1_1                                      /*!<@brief Pin name */
#define BOARD_SW5_LABEL "J12[12]/U29[4]/SW5/P1_1-USER_PB-USB1_OVRCURn" /*!<@brief Label */
#define BOARD_SW5_NAME "SW5"                                           /*!<@brief Identifier name */
#define BOARD_SW5_DIRECTION kPIN_MUX_DirectionInput                    /*!<@brief Direction */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M4F */

#define PIO22_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO22_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO314_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO314_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO33_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO33_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO3_3 (coord A13), J9[8]/LED2/P3_3-USR_LED2
  @{ */
#define BOARD_LED2_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_LED2_SIGNAL PIO3                        /*!<@brief GPIO signal: PIO3 */
#define BOARD_LED2_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_LED2_GPIO_PIN 3U                        /*!<@brief PIO3 pin index: 3 */
#define BOARD_LED2_PORT 3U                            /*!<@brief PORT device name: 3U */
#define BOARD_LED2_PIN 3U                             /*!<@brief 3U pin index: 3 */
#define BOARD_LED2_CHANNEL 3                          /*!<@brief GPIO PIO3 channel: 3 */
#define BOARD_LED2_PIN_NAME PIO3_3                    /*!<@brief Pin name */
#define BOARD_LED2_LABEL "J9[8]/LED2/P3_3-USR_LED2"   /*!<@brief Label */
#define BOARD_LED2_NAME "LED2"                        /*!<@brief Identifier name */
#define BOARD_LED2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                      /* @} */

