lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name PIO2_2 (coord C3), J9[6]/LED3/P2_2-CT1MAT1-USR_LED3
  @{ */
#define BOARD_LED3_PERIPHERAL GPIO                          /*!<@brief Device name: GPIO */
#define BOARD_LED3_SIGNAL PIO2                              /*!<@brief GPIO signal: PIO2 */
#define BOARD_LED3_GPIO GPIO                                /*!<@brief GPIO device name: GPIO */
#define BOARD_LED3_GPIO_PIN 2U                              /*!<@brief PIO2 pin index: 2 */
#define BOARD_LED3_PORT 2U                                  /*!<@brief PORT device name: 2U */
#define BOARD_LED3_PIN 2U                                   /*!<@brief 2U pin index: 2 */
#define BOARD_LED3_CHANNEL 2                                /*!<@brief GPIO PIO2 channel: 2 */
#define BOARD_LED3_PIN_NAME PIO2_2                          /*!<@brief Pin name */
#define BOARD_LED3_LABEL "J9[6]/LED3/P2_2-CT1MAT1-USR_LED3" /*!<@brief Label */
#define BOARD_LED3_NAME "LED3"                              /*!<@brief Identifier name */
#define BOARD_LED3_DIRECTION kPIN_MUX_DirectionOutput       /*!<@brief Direction */
                                                            /* @} */

/*! @name PIO3_14 (coord E3), J13[5]/LED1/P3_14-CT3MAT1-USR_LED1
  @{ */
#define BOARD_LED1_PERIPHERAL GPIO                            /*!<@brief Device name: GPIO */
#define BOARD_LED1_SIGNAL PIO3                                /*!<@brief GPIO signal: PIO3 */
#define BOARD_LED1_GPIO GPIO                                  /*!<@brief GPIO device name: GPIO */
#define BOARD_LED1_GPIO_PIN 14U                               /*!<@brief PIO3 pin index: 14 */
#define BOARD_LED1_PORT 3U                                    /*!<@brief PORT device name: 3U */
#define BOARD_LED1_PIN 14U                                    /*!<@brief 3U pin index: 14 */
#define BOARD_LED1_CHANNEL 14                                 /*!<@brief GPIO PIO3 channel: 14 */
#define BOARD_LED1_PIN_NAME PIO3_14                           /*!<@brief Pin name */
#define BOARD_LED1_LABEL "J13[5]/LED1/P3_14-CT3MAT1-USR_LED1" /*!<@brief Label */
#define BOARD_LED1_NAME "LED1"                                /*!<@brief Identifier name */
#define BOARD_LED1_DIRECTION kPIN_MUX_DirectionOutput         /*!<@brief Direction */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M4F */

#define PIO00_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO00_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO013_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO014_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO01_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO01_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO02_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO02_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO03_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO03_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO313_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO313_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name FC3_CTS_SDA_SSEL0 (coord A1), U26[14]/J14[1]/P0_1-ISP_FC3_SSEL0
  @{ */
#define BOARD_ISP_FC3_SSEL0_PERIPHERAL FLEXCOMM3                      /*!<@brief Device name: FLEXCOMM3 */
#define BOARD_ISP_FC3_SSEL0_SIGNAL CTS_SDA_SSEL0                      /*!<@brief FLEXCOMM3 signal: CTS_SDA_SSEL0 */
#define BOARD_ISP_FC3_SSEL0_PIN_NAME FC3_CTS_SDA_SSEL0                /*!<@brief Pin name */
#define BOARD_ISP_FC3_SSEL0_LABEL "U26[14]/J14[1]/P0_1-ISP_FC3_SSEL0" /*!<@brief Label */
#define BOARD_ISP_FC3_SSEL0_NAME "ISP_FC3_SSEL0"                      /*!<@brief Identifier name */
#define BOARD_ISP_FC3_SSEL0_DIRECTION kPIN_MUX_DirectionOutput        /*!<@brief Direction */
                                                                      /* @} */

/*! @name FC3_RXD_SDA_MOSI (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
/*!
 * @brief Device name: FLEXCOMM3 */
#define BOARD_ISP_FC3_MOSI_PERIPHERAL FLEXCOMM3
/*!
 * @brief FLEXCOMM3 signal: RXD_SDA_MOSI */
#define BOARD_ISP_FC3_MOSI_SIGNAL RXD_SDA_MOSI
/*!
 * @brief Pin name */
#define BOARD_ISP_FC3_MOSI_PIN_NAME FC3_RXD_SDA_MOSI
/*!
 * @brief Label */
#define BOARD_ISP_FC3_MOSI_LABEL "U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1"
/*!
 * @brief Identifier name */
#define BOARD_ISP_FC3_MOSI_NAME "ISP_FC3_MOSI"
/*!
 * @brief Direction */
#define BOARD_ISP_FC3_MOSI_DIRECTION kPIN_MUX_DirectionOutput
/* @} */

/*! @name FC3_TXD_SCL_MISO (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
/*!
 * @brief Device name: FLEXCOMM3 */
#define BOARD_ISP_FC3_MISO_PERIPHERAL FLEXCOMM3
/*!
 * @brief FLEXCOMM3 signal: TXD_SCL_MISO */
#define BOARD_ISP_FC3_MISO_SIGNAL TXD_SCL_MISO
/*!
 * @brief Pin name */
#define BOARD_ISP_FC3_MISO_PIN_NAME FC3_TXD_SCL_MISO
/*!
 * @brief Label */
#define BOARD_ISP_FC3_MISO_LABEL "U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0"
/*!
 * @brief Identifier name */
#define BOARD_ISP_FC3_MISO_NAME "ISP_FC3_MISO"
/*!
 * @brief Direction */
#define BOARD_ISP_FC3_MISO_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name FC3_SCK (coord D6), U26[13]/J14[4]/P0_0-ISP_FC3_SCK
  @{ */
#define BOARD_ISP_FC3_SCK_PERIPHERAL FLEXCOMM3                    /*!<@brief Device name: FLEXCOMM3 */
#define BOARD_ISP_FC3_SCK_SIGNAL SCK                              /*!<@brief FLEXCOMM3 signal: SCK */
#define BOARD_ISP_FC3_SCK_PIN_NAME FC3_SCK                        /*!<@brief Pin name */
#define BOARD_ISP_FC3_SCK_LABEL "U26[13]/J14[4]/P0_0-ISP_FC3_SCK" /*!<@brief Label */
#define BOARD_ISP_FC3_SCK_NAME "ISP_FC3_SCK"                      /*!<@brief Identifier name */
#define BOARD_ISP_FC3_SCK_DIRECTION kPIN_MUX_DirectionOutput      /*!<@brief Direction */
                                                                  /* @} */

