lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name PIO3_13 (coord H4), J14[8]/P3_13-BRIDGE_GPIO
  @{ */
#define BOARD_BRIDGE_GPIO_PERIPHERAL GPIO                  /*!<@brief Device name: GPIO */
#define BOARD_BRIDGE_GPIO_SIGNAL PIO3                      /*!<@brief GPIO signal: PIO3 */
#define BOARD_BRIDGE_GPIO_GPIO GPIO                        /*!<@brief GPIO device name: GPIO */
#define BOARD_BRIDGE_GPIO_GPIO_PIN 13U                     /*!<@brief PIO3 pin index: 13 */
#define BOARD_BRIDGE_GPIO_PORT 3U                          /*!<@brief PORT device name: 3U */
#define BOARD_BRIDGE_GPIO_PIN 13U                          /*!<@brief 3U pin index: 13 */
#define BOARD_BRIDGE_GPIO_CHANNEL 13                       /*!<@brief GPIO PIO3 channel: 13 */
#define BOARD_BRIDGE_GPIO_PIN_NAME PIO3_13                 /*!<@brief Pin name */
#define BOARD_BRIDGE_GPIO_LABEL "J14[8]/P3_13-BRIDGE_GPIO" /*!<@brief Label */
#define BOARD_BRIDGE_GPIO_NAME "BRIDGE_GPIO"               /*!<@brief Identifier name */
                                                           /* @} */

/*! @name FC1_CTS_SDA_SSEL0 (coord F11), JS16[2]/J14[9]/P0_13-ISP_FC1_SDAX
  @{ */
#define BOARD_ISP_FC1_SDAX_PERIPHERAL FLEXCOMM1                      /*!<@brief Device name: FLEXCOMM1 */
#define BOARD_ISP_FC1_SDAX_SIGNAL CTS_SDA_SSEL0                      /*!<@brief FLEXCOMM1 signal: CTS_SDA_SSEL0 */
#define BOARD_ISP_FC1_SDAX_PIN_NAME FC1_CTS_SDA_SSEL0                /*!<@brief Pin name */
#define BOARD_ISP_FC1_SDAX_LABEL "JS16[2]/J14[9]/P0_13-ISP_FC1_SDAX" /*!<@brief Label */
#define BOARD_ISP_FC1_SDAX_NAME "ISP_FC1_SDAX"                       /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name FC1_RTS_SCL_SSEL1 (coord E13), JS15[2]/J14[10]/P0_14-ISP_FC1_SCLX
  @{ */
#define BOARD_ISP_FC1_SCLX_PERIPHERAL FLEXCOMM1                       /*!<@brief Device name: FLEXCOMM1 */
#define BOARD_ISP_FC1_SCLX_SIGNAL RTS_SCL_SSEL1                       /*!<@brief FLEXCOMM1 signal: RTS_SCL_SSEL1 */
#define BOARD_ISP_FC1_SCLX_PIN_NAME FC1_RTS_SCL_SSEL1                 /*!<@brief Pin name */
#define BOARD_ISP_FC1_SCLX_LABEL "JS15[2]/J14[10]/P0_14-ISP_FC1_SCLX" /*!<@brief Label */
#define BOARD_ISP_FC1_SCLX_NAME "ISP_FC1_SCLX"                        /*!<@brief Identifier name */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C_BRIDGEPins(void); /* Function assigned for the Cortex-M4F */

#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO34_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO34_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name FC2_CTS_SDA_SSEL0 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
/*!
 * @brief Device name: FLEXCOMM2 */
#define BOARD_FC2_SDAX_PERIPHERAL FLEXCOMM2
/*!
 * @brief FLEXCOMM2 signal: CTS_SDA_SSEL0 */
#define BOARD_FC2_SDAX_SIGNAL CTS_SDA_SSEL0
/*!
 * @brief Pin name */
#define BOARD_FC2_SDAX_PIN_NAME FC2_CTS_SDA_SSEL0
/*!
 * @brief Label */
#define BOARD_FC2_SDAX_LABEL "J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX"
/*!
 * @brief Identifier name */
#define BOARD_FC2_SDAX_NAME "FC2_SDAX"
/* @} */

/*! @name FC2_RTS_SCL_SSEL1 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
/*!
 * @brief Device name: FLEXCOMM2 */
#define BOARD_FC2_SCLX_PERIPHERAL FLEXCOMM2
/*!
 * @brief FLEXCOMM2 signal: RTS_SCL_SSEL1 */
#define BOARD_FC2_SCLX_SIGNAL RTS_SCL_SSEL1
/*!
 * @brief Pin name */
#define BOARD_FC2_SCLX_PIN_NAME FC2_RTS_SCL_SSEL1
/*!
 * @brief Label */
#define BOARD_FC2_SCLX_LABEL "J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX"
/*!
 * @brief Identifier name */
#define BOARD_FC2_SCLX_NAME "FC2_SCLX"
/* @} */

/*! @name PIO3_4 (coord B11), J12[10]/U19[3]/P3_4-ACCL_INTR
  @{ */
#define BOARD_ACCL_INTR_PERIPHERAL GPIO                       /*!<@brief Device name: GPIO */
#define BOARD_ACCL_INTR_SIGNAL PIO3                           /*!<@brief GPIO signal: PIO3 */
#define BOARD_ACCL_INTR_GPIO GPIO                             /*!<@brief GPIO device name: GPIO */
#define BOARD_ACCL_INTR_GPIO_PIN 4U                           /*!<@brief PIO3 pin index: 4 */
#define BOARD_ACCL_INTR_PORT 3U                               /*!<@brief PORT device name: 3U */
#define BOARD_ACCL_INTR_PIN 4U                                /*!<@brief 3U pin index: 4 */
#define BOARD_ACCL_INTR_CHANNEL 4                             /*!<@brief GPIO PIO3 channel: 4 */
#define BOARD_ACCL_INTR_PIN_NAME PIO3_4                       /*!<@brief Pin name */
#define BOARD_ACCL_INTR_LABEL "J12[10]/U19[3]/P3_4-ACCL_INTR" /*!<@brief Label */
#define BOARD_ACCL_INTR_NAME "ACCL_INTR"                      /*!<@brief Identifier name */
#define BOARD_ACCL_INTR_DIRECTION kPIN_MUX_DirectionInput     /*!<@brief Direction */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M4F */

#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO212_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO212_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name SPIFI_CLK (coord M13), J13[2]/U27[6]/P0_26-SPIFI_CLK
  @{ */
#define BOARD_SPIFI_CLK_PERIPHERAL SPIFI0                     /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_CLK_SIGNAL SPIFI_SCK                      /*!<@brief SPIFI0 signal: SPIFI_SCK */
#define BOARD_SPIFI_CLK_PIN_NAME SPIFI_CLK                    /*!<@brief Pin name */
#define BOARD_SPIFI_CLK_LABEL "J13[2]/U27[6]/P0_26-SPIFI_CLK" /*!<@brief Label */
#define BOARD_SPIFI_CLK_NAME "SPIFI_CLK"                      /*!<@brief Identifier name */
                                                              /* @} */

/*! @name SPIFI_IO(0) (coord M7), J13[6]/U27[5]/P0_24-SPIFI_IO0
  @{ */
#define BOARD_SPIFI_IO0_PERIPHERAL SPIFI0                     /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO0_SIGNAL SPIFI_IO0/SPIFI_MOSI           /*!<@brief SPIFI0 signal: SPIFI_IO0/SPIFI_MOSI */
#define BOARD_SPIFI_IO0_PIN_NAME SPIFI_IO(0)                  /*!<@brief Pin name */
#define BOARD_SPIFI_IO0_LABEL "J13[6]/U27[5]/P0_24-SPIFI_IO0" /*!<@brief Label */
#define BOARD_SPIFI_IO0_NAME "SPIFI_IO0"                      /*!<@brief Identifier name */
                                                              /* @} */

/*! @name SPIFI_IO(1) (coord K8), J13[4]/U27[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_SPIFI_IO1_PERIPHERAL SPIFI0                     /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO1_SIGNAL SPIFI_IO1/SPIFI_MISO           /*!<@brief SPIFI0 signal: SPIFI_IO1/SPIFI_MISO */
#define BOARD_SPIFI_IO1_PIN_NAME SPIFI_IO(1)                  /*!<@brief Pin name */
#define BOARD_SPIFI_IO1_LABEL "J13[4]/U27[2]/P0_25-SPIFI_IO1" /*!<@brief Label */
#define BOARD_SPIFI_IO1_NAME "SPIFI_IO1"                      /*!<@brief Identifier name */
                                                              /* @} */

/*! @name SPIFI_IO(3) (coord L9), J13[12]/U27[7]/P0_27-SPIFI_IO3
  @{ */
#define BOARD_SPIFI_IO3_PERIPHERAL SPIFI0                      /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO3_SIGNAL SPIFI_IO                        /*!<@brief SPIFI0 signal: SPIFI_IO */
#define BOARD_SPIFI_IO3_CHANNEL 3                              /*!<@brief SPIFI0 SPIFI_IO channel: 3 */
#define BOARD_SPIFI_IO3_PIN_NAME SPIFI_IO(3)                   /*!<@brief Pin name */
#define BOARD_SPIFI_IO3_LABEL "J13[12]/U27[7]/P0_27-SPIFI_IO3" /*!<@brief Label */
#define BOARD_SPIFI_IO3_NAME "SPIFI_IO3"                       /*!<@brief Identifier name */
                                                               /* @} */

/*! @name SPIFI_IO(2) (coord M9), J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
/*!
 * @brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO2_PERIPHERAL SPIFI0
/*!
 * @brief SPIFI0 signal: SPIFI_IO */
#define BOARD_SPIFI_IO2_SIGNAL SPIFI_IO
/*!
 * @brief SPIFI0 SPIFI_IO channel: 2 */
#define BOARD_SPIFI_IO2_CHANNEL 2
/*!
 * @brief Pin name */
#define BOARD_SPIFI_IO2_PIN_NAME SPIFI_IO(2)
/*!
 * @brief Label */
#define BOARD_SPIFI_IO2_LABEL "J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn"
/*!
 * @brief Identifier name */
#define BOARD_SPIFI_IO2_NAME "SPIFI_IO2"
/* @} */

