lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name SPIFI_CSN (coord N7), J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
#define BOARD_SPIFI_CSn_PERIPHERAL SPIFI0                          /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_CSn_SIGNAL SPIFI_CSN                           /*!<@brief SPIFI0 signal: SPIFI_CSN */
#define BOARD_SPIFI_CSn_PIN_NAME SPIFI_CSN                         /*!<@brief Pin name */
#define BOARD_SPIFI_CSn_LABEL "J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK" /*!<@brief Label */
#define BOARD_SPIFI_CSn_NAME "SPIFI_CSn"                           /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name PIO2_12 (coord M2), U26A1[3]/P2_12-SPIFI_RSTn
  @{ */
#define BOARD_SPIFI_RSTn_PERIPHERAL GPIO                   /*!<@brief Device name: GPIO */
#define BOARD_SPIFI_RSTn_SIGNAL PIO2                       /*!<@brief GPIO signal: PIO2 */
#define BOARD_SPIFI_RSTn_GPIO GPIO                         /*!<@brief GPIO device name: GPIO */
#define BOARD_SPIFI_RSTn_GPIO_PIN 12U                      /*!<@brief PIO2 pin index: 12 */
#define BOARD_SPIFI_RSTn_PORT 2U                           /*!<@brief PORT device name: 2U */
#define BOARD_SPIFI_RSTn_PIN 12U                           /*!<@brief 2U pin index: 12 */
#define BOARD_SPIFI_RSTn_CHANNEL 12                        /*!<@brief GPIO PIO2 channel: 12 */
#define BOARD_SPIFI_RSTn_PIN_NAME PIO2_12                  /*!<@brief Pin name */
#define BOARD_SPIFI_RSTn_LABEL "U26A1[3]/P2_12-SPIFI_RSTn" /*!<@brief Label */
#define BOARD_SPIFI_RSTn_NAME "SPIFI_RSTn"                 /*!<@brief Identifier name */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASHPins(void); /* Function assigned for the Cortex-M4F */

#define PIO210_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO210_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO23_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO23_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO24_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO24_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO25_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO25_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO26_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO26_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO27_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO27_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO28_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO28_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO29_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO29_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO315_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO315_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name SD_WR_PRT (coord D2), RP1[1]/U9[8]/P3_15-SD_WPn
  @{ */
#define BOARD_SD_WPn_PERIPHERAL SDIF                   /*!<@brief Device name: SDIF */
#define BOARD_SD_WPn_SIGNAL SD_WR_PRT                  /*!<@brief SDIF signal: SD_WR_PRT */
#define BOARD_SD_WPn_PIN_NAME SD_WR_PRT                /*!<@brief Pin name */
#define BOARD_SD_WPn_LABEL "RP1[1]/U9[8]/P3_15-SD_WPn" /*!<@brief Label */
#define BOARD_SD_WPn_NAME "SD_WPn"                     /*!<@brief Identifier name */
                                                       /* @} */

/*! @name SD_CARD_DET_N (coord P1), RP1[2]/U9[7]/P2_10-SD_CDn
  @{ */
#define BOARD_SD_CDn_PERIPHERAL SDIF                   /*!<@brief Device name: SDIF */
#define BOARD_SD_CDn_SIGNAL SD_CARD_DET                /*!<@brief SDIF signal: SD_CARD_DET */
#define BOARD_SD_CDn_PIN_NAME SD_CARD_DET_N            /*!<@brief Pin name */
#define BOARD_SD_CDn_LABEL "RP1[2]/U9[7]/P2_10-SD_CDn" /*!<@brief Label */
#define BOARD_SD_CDn_NAME "SD_CDn"                     /*!<@brief Identifier name */
                                                       /* @} */

/*! @name SD_D(2) (coord F4), RP1[3]/U9[6]/P2_8-SD_D2
  @{ */
#define BOARD_SD_D2_PERIPHERAL SDIF                 /*!<@brief Device name: SDIF */
#define BOARD_SD_D2_SIGNAL SD_D                     /*!<@brief SDIF signal: SD_D */
#define BOARD_SD_D2_CHANNEL 2                       /*!<@brief SDIF SD_D channel: 2 */
#define BOARD_SD_D2_PIN_NAME SD_D(2)                /*!<@brief Pin name */
#define BOARD_SD_D2_LABEL "RP1[3]/U9[6]/P2_8-SD_D2" /*!<@brief Label */
#define BOARD_SD_D2_NAME "SD_D2"                    /*!<@brief Identifier name */
                                                    /* @} */

/*! @name SD_D(1) (coord J2), RP1[4]/U9[5]/P2_7-SD_D1
  @{ */
#define BOARD_SD_D1_PERIPHERAL SDIF                 /*!<@brief Device name: SDIF */
#define BOARD_SD_D1_SIGNAL SD_D                     /*!<@brief SDIF signal: SD_D */
#define BOARD_SD_D1_CHANNEL 1                       /*!<@brief SDIF SD_D channel: 1 */
#define BOARD_SD_D1_PIN_NAME SD_D(1)                /*!<@brief Pin name */
#define BOARD_SD_D1_LABEL "RP1[4]/U9[5]/P2_7-SD_D1" /*!<@brief Label */
#define BOARD_SD_D1_NAME "SD_D1"                    /*!<@brief Identifier name */
                                                    /* @} */

/*! @name SD_D(0) (coord F3), RP1[5]/U9[4]/P2_6-SD_D0
  @{ */
#define BOARD_SD_D0_PERIPHERAL SDIF                 /*!<@brief Device name: SDIF */
#define BOARD_SD_D0_SIGNAL SD_D                     /*!<@brief SDIF signal: SD_D */
#define BOARD_SD_D0_CHANNEL 0                       /*!<@brief SDIF SD_D channel: 0 */
#define BOARD_SD_D0_PIN_NAME SD_D(0)                /*!<@brief Pin name */
#define BOARD_SD_D0_LABEL "RP1[5]/U9[4]/P2_6-SD_D0" /*!<@brief Label */
#define BOARD_SD_D0_NAME "SD_D0"                    /*!<@brief Identifier name */
                                                    /* @} */

/*! @name SD_CLK (coord B1), U9[3]/P2_3-SD_CLK
  @{ */
#define BOARD_SD_CLK_PERIPHERAL SDIF           /*!<@brief Device name: SDIF */
#define BOARD_SD_CLK_SIGNAL SD_CLK             /*!<@brief SDIF signal: SD_CLK */
#define BOARD_SD_CLK_PIN_NAME SD_CLK           /*!<@brief Pin name */
#define BOARD_SD_CLK_LABEL "U9[3]/P2_3-SD_CLK" /*!<@brief Label */
#define BOARD_SD_CLK_NAME "SD_CLK"             /*!<@brief Identifier name */
                                               /* @} */

/*! @name SD_CMD (coord D3), RP1[6]/U9[2]/P2_4-SD_CMD
  @{ */
#define BOARD_SD_CMD_PERIPHERAL SDIF                  /*!<@brief Device name: SDIF */
#define BOARD_SD_CMD_SIGNAL SD_CMD                    /*!<@brief SDIF signal: SD_CMD */
#define BOARD_SD_CMD_PIN_NAME SD_CMD                  /*!<@brief Pin name */
#define BOARD_SD_CMD_LABEL "RP1[6]/U9[2]/P2_4-SD_CMD" /*!<@brief Label */
#define BOARD_SD_CMD_NAME "SD_CMD"                    /*!<@brief Identifier name */
                                                      /* @} */

/*! @name SD_D(3) (coord K2), RP1[7]/U9[1]/P2_9-SD_D3
  @{ */
#define BOARD_SD_D3_PERIPHERAL SDIF                 /*!<@brief Device name: SDIF */
#define BOARD_SD_D3_SIGNAL SD_D                     /*!<@brief SDIF signal: SD_D */
#define BOARD_SD_D3_CHANNEL 3                       /*!<@brief SDIF SD_D channel: 3 */
#define BOARD_SD_D3_PIN_NAME SD_D(3)                /*!<@brief Pin name */
#define BOARD_SD_D3_LABEL "RP1[7]/U9[1]/P2_9-SD_D3" /*!<@brief Label */
#define BOARD_SD_D3_NAME "SD_D3"                    /*!<@brief Identifier name */
                                                    /* @} */

