lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name EMC_RASN (coord N9), U28[F8]/P1_10-EMC_RASn
  @{ */
#define BOARD_EMC_RASn_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_EMC_RASn_SIGNAL EMC_RAS                 /*!<@brief EMC signal: EMC_RAS */
#define BOARD_EMC_RASn_PIN_NAME EMC_RASN              /*!<@brief Pin name */
#define BOARD_EMC_RASn_LABEL "U28[F8]/P1_10-EMC_RASn" /*!<@brief Label */
#define BOARD_EMC_RASn_NAME "EMC_RASn"                /*!<@brief Identifier name */
                                                      /* @} */

/*! @name EMC_DYCSN(0) (coord K9), U28[G9]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_EMC_DYCSn0_PERIPHERAL EMC                   /*!<@brief Device name: EMC */
#define BOARD_EMC_DYCSn0_SIGNAL EMC_DYCS                  /*!<@brief EMC signal: EMC_DYCS */
#define BOARD_EMC_DYCSn0_CHANNEL 0                        /*!<@brief EMC EMC_DYCS channel: 0 */
#define BOARD_EMC_DYCSn0_PIN_NAME EMC_DYCSN(0)            /*!<@brief Pin name */
#define BOARD_EMC_DYCSn0_LABEL "U28[G9]/P1_12-EMC_DYCSn0" /*!<@brief Label */
#define BOARD_EMC_DYCSn0_NAME "EMC_DYCSn0"                /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_D(15) (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15
  @{ */
#define BOARD_EMC_D15_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_EMC_D15_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D15_CHANNEL 15                           /*!<@brief EMC EMC_D channel: 15 */
#define BOARD_EMC_D15_PIN_NAME EMC_D(15)                   /*!<@brief Pin name */
#define BOARD_EMC_D15_LABEL "U28[A2]/RP2[1]/P1_31-EMC_D15" /*!<@brief Label */
#define BOARD_EMC_D15_NAME "EMC_D15"                       /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_D(14) (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14
  @{ */
#define BOARD_EMC_D14_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_EMC_D14_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D14_CHANNEL 14                           /*!<@brief EMC EMC_D channel: 14 */
#define BOARD_EMC_D14_PIN_NAME EMC_D(14)                   /*!<@brief Pin name */
#define BOARD_EMC_D14_LABEL "U28[B1]/RP2[2]/P1_30-EMC_D14" /*!<@brief Label */
#define BOARD_EMC_D14_NAME "EMC_D14"                       /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_D(13) (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13
  @{ */
#define BOARD_EMC_D13_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_EMC_D13_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D13_CHANNEL 13                           /*!<@brief EMC EMC_D channel: 13 */
#define BOARD_EMC_D13_PIN_NAME EMC_D(13)                   /*!<@brief Pin name */
#define BOARD_EMC_D13_LABEL "U28[B2]/RP2[3]/P1_29-EMC_D13" /*!<@brief Label */
#define BOARD_EMC_D13_NAME "EMC_D13"                       /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_D(12) (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12
  @{ */
#define BOARD_EMC_D12_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_EMC_D12_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D12_CHANNEL 12                           /*!<@brief EMC EMC_D channel: 12 */
#define BOARD_EMC_D12_PIN_NAME EMC_D(12)                   /*!<@brief Pin name */
#define BOARD_EMC_D12_LABEL "U28[C1]/RP2[4]/P1_28-EMC_D12" /*!<@brief Label */
#define BOARD_EMC_D12_NAME "EMC_D12"                       /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_D(11) (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
#define BOARD_EMC_D11_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_EMC_D11_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D11_CHANNEL 11                          /*!<@brief EMC EMC_D channel: 11 */
#define BOARD_EMC_D11_PIN_NAME EMC_D(11)                  /*!<@brief Pin name */
#define BOARD_EMC_D11_LABEL "U28[C2]/RP4[1]/P1_4-EMC_D11" /*!<@brief Label */
#define BOARD_EMC_D11_NAME "EMC_D11"                      /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_D(10) (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10
  @{ */
#define BOARD_EMC_D10_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_EMC_D10_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D10_CHANNEL 10                           /*!<@brief EMC EMC_D channel: 10 */
#define BOARD_EMC_D10_PIN_NAME EMC_D(10)                   /*!<@brief Pin name */
#define BOARD_EMC_D10_LABEL "U28[D1]/RP4[2]/P1_21-EMC_D10" /*!<@brief Label */
#define BOARD_EMC_D10_NAME "EMC_D10"                       /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_D(9) (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9
  @{ */
#define BOARD_EMC_D9_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_EMC_D9_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D9_CHANNEL 9                           /*!<@brief EMC EMC_D channel: 9 */
#define BOARD_EMC_D9_PIN_NAME EMC_D(9)                   /*!<@brief Pin name */
#define BOARD_EMC_D9_LABEL "U28[D2]/RP4[3]/P1_20-EMC_D9" /*!<@brief Label */
#define BOARD_EMC_D9_NAME "EMC_D9"                       /*!<@brief Identifier name */
                                                         /* @} */

/*! @name EMC_D(8) (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
#define BOARD_EMC_D8_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_EMC_D8_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D8_CHANNEL 8                           /*!<@brief EMC EMC_D channel: 8 */
#define BOARD_EMC_D8_PIN_NAME EMC_D(8)                   /*!<@brief Pin name */
#define BOARD_EMC_D8_LABEL "U28[E1]/RP4[4]/P1_19-EMC_D8" /*!<@brief Label */
#define BOARD_EMC_D8_NAME "EMC_D8"                       /*!<@brief Identifier name */
                                                         /* @} */

/*! @name EMC_D(7) (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
#define BOARD_EMC_D7_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_EMC_D7_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D7_CHANNEL 7                          /*!<@brief EMC EMC_D channel: 7 */
#define BOARD_EMC_D7_PIN_NAME EMC_D(7)                  /*!<@brief Pin name */
#define BOARD_EMC_D7_LABEL "U28[E9]/RP5[1]/P0_9-EMC_D7" /*!<@brief Label */
#define BOARD_EMC_D7_NAME "EMC_D7"                      /*!<@brief Identifier name */
                                                        /* @} */

