lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name EMC_D(6) (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
#define BOARD_EMC_D6_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_EMC_D6_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D6_CHANNEL 6                          /*!<@brief EMC EMC_D channel: 6 */
#define BOARD_EMC_D6_PIN_NAME EMC_D(6)                  /*!<@brief Pin name */
#define BOARD_EMC_D6_LABEL "U28[D8]/RP5[2]/P0_8-EMC_D6" /*!<@brief Label */
#define BOARD_EMC_D6_NAME "EMC_D6"                      /*!<@brief Identifier name */
                                                        /* @} */

/*! @name EMC_D(5) (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
#define BOARD_EMC_D5_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_EMC_D5_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D5_CHANNEL 5                          /*!<@brief EMC EMC_D channel: 5 */
#define BOARD_EMC_D5_PIN_NAME EMC_D(5)                  /*!<@brief Pin name */
#define BOARD_EMC_D5_LABEL "U28[D9]/RP5[3]/P0_7-EMC_D5" /*!<@brief Label */
#define BOARD_EMC_D5_NAME "EMC_D5"                      /*!<@brief Identifier name */
                                                        /* @} */

/*! @name EMC_D(4) (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
#define BOARD_EMC_D4_PERIPHERAL EMC                                   /*!<@brief Device name: EMC */
#define BOARD_EMC_D4_SIGNAL EMC_D                                     /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D4_CHANNEL 4                                        /*!<@brief EMC EMC_D channel: 4 */
#define BOARD_EMC_D4_PIN_NAME EMC_D(4)                                /*!<@brief Pin name */
#define BOARD_EMC_D4_LABEL "U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4" /*!<@brief Label */
#define BOARD_EMC_D4_NAME "EMC_D4"                                    /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name EMC_D(3) (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_EMC_D3_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_EMC_D3_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 3 */
#define BOARD_EMC_D3_CHANNEL 3
/*!
 * @brief Pin name */
#define BOARD_EMC_D3_PIN_NAME EMC_D(3)
/*!
 * @brief Label */
#define BOARD_EMC_D3_LABEL "U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3"
/*!
 * @brief Identifier name */
#define BOARD_EMC_D3_NAME "EMC_D3"
/* @} */

/*! @name EMC_D(2) (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_EMC_D2_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_EMC_D2_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 2 */
#define BOARD_EMC_D2_CHANNEL 2
/*!
 * @brief Pin name */
#define BOARD_EMC_D2_PIN_NAME EMC_D(2)
/*!
 * @brief Label */
#define BOARD_EMC_D2_LABEL "U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2"
/*!
 * @brief Identifier name */
#define BOARD_EMC_D2_NAME "EMC_D2"
/* @} */

/*! @name EMC_D(1) (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_EMC_D1_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_EMC_D1_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 1 */
#define BOARD_EMC_D1_CHANNEL 1
/*!
 * @brief Pin name */
#define BOARD_EMC_D1_PIN_NAME EMC_D(1)
/*!
 * @brief Label */
#define BOARD_EMC_D1_LABEL "U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1"
/*!
 * @brief Identifier name */
#define BOARD_EMC_D1_NAME "EMC_D1"
/* @} */

/*! @name EMC_D(0) (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_EMC_D0_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_EMC_D0_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 0 */
#define BOARD_EMC_D0_CHANNEL 0
/*!
 * @brief Pin name */
#define BOARD_EMC_D0_PIN_NAME EMC_D(0)
/*!
 * @brief Label */
#define BOARD_EMC_D0_LABEL "U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0"
/*!
 * @brief Identifier name */
#define BOARD_EMC_D0_NAME "EMC_D0"
/* @} */

/*! @name EMC_DQM(1) (coord C12), U28[F1]/P1_14-EMC_DQM1
  @{ */
#define BOARD_EMC_DQM1_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_EMC_DQM1_SIGNAL EMC_DQM                 /*!<@brief EMC signal: EMC_DQM */
#define BOARD_EMC_DQM1_CHANNEL 1                      /*!<@brief EMC EMC_DQM channel: 1 */
#define BOARD_EMC_DQM1_PIN_NAME EMC_DQM(1)            /*!<@brief Pin name */
#define BOARD_EMC_DQM1_LABEL "U28[F1]/P1_14-EMC_DQM1" /*!<@brief Label */
#define BOARD_EMC_DQM1_NAME "EMC_DQM1"                /*!<@brief Identifier name */
                                                      /* @} */

/*! @name EMC_DQM(0) (coord G10), U28[E8]/P1_13-EMC_DQM0
  @{ */
#define BOARD_EMC_DQM0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_EMC_DQM0_SIGNAL EMC_DQM                 /*!<@brief EMC signal: EMC_DQM */
#define BOARD_EMC_DQM0_CHANNEL 0                      /*!<@brief EMC EMC_DQM channel: 0 */
#define BOARD_EMC_DQM0_PIN_NAME EMC_DQM(0)            /*!<@brief Pin name */
#define BOARD_EMC_DQM0_LABEL "U28[E8]/P1_13-EMC_DQM0" /*!<@brief Label */
#define BOARD_EMC_DQM0_NAME "EMC_DQM0"                /*!<@brief Identifier name */
                                                      /* @} */

/*! @name EMC_CLK(0) (coord B4), U28[F2]/P1_11-EMC_CLK0
  @{ */
#define BOARD_EMC_CLK0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_EMC_CLK0_SIGNAL EMC_CLK                 /*!<@brief EMC signal: EMC_CLK */
#define BOARD_EMC_CLK0_CHANNEL 0                      /*!<@brief EMC EMC_CLK channel: 0 */
#define BOARD_EMC_CLK0_PIN_NAME EMC_CLK(0)            /*!<@brief Pin name */
#define BOARD_EMC_CLK0_LABEL "U28[F2]/P1_11-EMC_CLK0" /*!<@brief Label */
#define BOARD_EMC_CLK0_NAME "EMC_CLK0"                /*!<@brief Identifier name */
                                                      /* @} */

/*! @name EMC_CKE(0) (coord A11), U28[F3]/P1_15-EMC_CKE0
  @{ */
#define BOARD_EMC_CKE0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_EMC_CKE0_SIGNAL EMC_CKE                 /*!<@brief EMC signal: EMC_CKE */
#define BOARD_EMC_CKE0_CHANNEL 0                      /*!<@brief EMC EMC_CKE channel: 0 */
#define BOARD_EMC_CKE0_PIN_NAME EMC_CKE(0)            /*!<@brief Pin name */
#define BOARD_EMC_CKE0_LABEL "U28[F3]/P1_15-EMC_CKE0" /*!<@brief Label */
#define BOARD_EMC_CKE0_NAME "EMC_CKE0"                /*!<@brief Identifier name */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void); /* Function assigned for the Cortex-M4F */

#define PIO022_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO022_FUNC_ALT7 0x07u        /*!<@brief Selects pin function.: Alternative connection 7. */
#define PIO411_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO411_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */

/*! @name USB1_DP (coord H3), J2[3]/U2[2]/U25[H3]/USB1_DP_TRGT
  @{ */
#define BOARD_USB1_DP_PERIPHERAL USBHSH                        /*!<@brief Device name: USBHSH */
#define BOARD_USB1_DP_SIGNAL USB_DP                            /*!<@brief USBHSH signal: USB_DP */
#define BOARD_USB1_DP_PIN_NAME USB1_DP                         /*!<@brief Pin name */
#define BOARD_USB1_DP_LABEL "J2[3]/U2[2]/U25[H3]/USB1_DP_TRGT" /*!<@brief Label */
#define BOARD_USB1_DP_NAME "USB1_DP"                           /*!<@brief Identifier name */
                                                               /* @} */

/*! @name USB1_DM (coord H2), J2[2]/U2[3]/U25[H2]/USB1_DM_TRGT
  @{ */
#define BOARD_USB1_DM_PERIPHERAL USBHSH                        /*!<@brief Device name: USBHSH */
#define BOARD_USB1_DM_SIGNAL USB_DM                            /*!<@brief USBHSH signal: USB_DM */
#define BOARD_USB1_DM_PIN_NAME USB1_DM                         /*!<@brief Pin name */
#define BOARD_USB1_DM_LABEL "J2[2]/U2[3]/U25[H2]/USB1_DM_TRGT" /*!<@brief Label */
#define BOARD_USB1_DM_NAME "USB1_DM"                           /*!<@brief Identifier name */
                                                               /* @} */

/*! @name USB0_DM (coord D5), J3[2]/U3[3]/USB0_DM_TRGT
  @{ */
#define BOARD_USB0_DM_PERIPHERAL USBFSH                /*!<@brief Device name: USBFSH */
#define BOARD_USB0_DM_SIGNAL USB_DM                    /*!<@brief USBFSH signal: USB_DM */
#define BOARD_USB0_DM_PIN_NAME USB0_DM                 /*!<@brief Pin name */
#define BOARD_USB0_DM_LABEL "J3[2]/U3[3]/USB0_DM_TRGT" /*!<@brief Label */
#define BOARD_USB0_DM_NAME "USB0_DM"                   /*!<@brief Identifier name */
                                                       /* @} */

