lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name USB0_DP (coord E5), J3[3]/U3[2]/USB0_DP_TRGT
  @{ */
#define BOARD_USB0_DP_PERIPHERAL USBFSH                /*!<@brief Device name: USBFSH */
#define BOARD_USB0_DP_SIGNAL USB_DP                    /*!<@brief USBFSH signal: USB_DP */
#define BOARD_USB0_DP_PIN_NAME USB0_DP                 /*!<@brief Pin name */
#define BOARD_USB0_DP_LABEL "J3[3]/U3[2]/USB0_DP_TRGT" /*!<@brief Label */
#define BOARD_USB0_DP_NAME "USB0_DP"                   /*!<@brief Identifier name */
                                                       /* @} */

/*! @name USB1_VBUS (coord G2), J2[1]/U2[4]/VBUS1_TARGET
  @{ */
#define BOARD_USB1_VBUS_PERIPHERAL USBHSH                /*!<@brief Device name: USBHSH */
#define BOARD_USB1_VBUS_SIGNAL USB_VBUS                  /*!<@brief USBHSH signal: USB_VBUS */
#define BOARD_USB1_VBUS_PIN_NAME USB1_VBUS               /*!<@brief Pin name */
#define BOARD_USB1_VBUS_LABEL "J2[1]/U2[4]/VBUS1_TARGET" /*!<@brief Label */
#define BOARD_USB1_VBUS_NAME "USB1_VBUS"                 /*!<@brief Identifier name */
                                                         /* @} */

/*! @name USB0_VBUS (coord B12), U3[4]/J3[1]/P0_22-USB0_VBUS
  @{ */
#define BOARD_USB0_VBUS_PERIPHERAL USBFSH                   /*!<@brief Device name: USBFSH */
#define BOARD_USB0_VBUS_SIGNAL USB_VBUS                     /*!<@brief USBFSH signal: USB_VBUS */
#define BOARD_USB0_VBUS_PIN_NAME USB0_VBUS                  /*!<@brief Pin name */
#define BOARD_USB0_VBUS_LABEL "U3[4]/J3[1]/P0_22-USB0_VBUS" /*!<@brief Label */
#define BOARD_USB0_VBUS_NAME "USB0_VBUS"                    /*!<@brief Identifier name */
                                                            /* @} */

/*! @name USB1_ID (coord G1), J2[4]/USB1_ID_TARGET
  @{ */
#define BOARD_USB1_ID_PERIPHERAL USBHSH            /*!<@brief Device name: USBHSH */
#define BOARD_USB1_ID_SIGNAL USB_IDVALUE           /*!<@brief USBHSH signal: USB_IDVALUE */
#define BOARD_USB1_ID_PIN_NAME USB1_ID             /*!<@brief Pin name */
#define BOARD_USB1_ID_LABEL "J2[4]/USB1_ID_TARGET" /*!<@brief Label */
#define BOARD_USB1_ID_NAME "USB1_ID"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name USB0_IDVALUE (coord A9), U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0
  @{ */
/*!
 * @brief Device name: USBFSH */
#define BOARD_ENET_RXD0_PERIPHERAL USBFSH
/*!
 * @brief USBFSH signal: USB_IDVALUE */
#define BOARD_ENET_RXD0_SIGNAL USB_IDVALUE
/*!
 * @brief Pin name */
#define BOARD_ENET_RXD0_PIN_NAME USB0_IDVALUE
/*!
 * @brief Label */
#define BOARD_ENET_RXD0_LABEL "U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0"
/*!
 * @brief Identifier name */
#define BOARD_ENET_RXD0_NAME "ENET_RXD0"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M4F */

#define PIO029_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO030_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO030_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name FC0_RXD_SDA_MOSI (coord B13), U24[13]/P0_29-ISP_FC0_RXD
  @{ */
#define BOARD_ISP_FC0_RXD_PERIPHERAL FLEXCOMM0              /*!<@brief Device name: FLEXCOMM0 */
#define BOARD_ISP_FC0_RXD_SIGNAL RXD_SDA_MOSI               /*!<@brief FLEXCOMM0 signal: RXD_SDA_MOSI */
#define BOARD_ISP_FC0_RXD_PIN_NAME FC0_RXD_SDA_MOSI         /*!<@brief Pin name */
#define BOARD_ISP_FC0_RXD_LABEL "U24[13]/P0_29-ISP_FC0_RXD" /*!<@brief Label */
#define BOARD_ISP_FC0_RXD_NAME "ISP_FC0_RXD"                /*!<@brief Identifier name */
#define BOARD_ISP_FC0_RXD_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                            /* @} */

/*! @name FC0_TXD_SCL_MISO (coord A2), U24[12]/P0_30-ISP_FC0_TXD
  @{ */
#define BOARD_ISP_FC0_TXD_PERIPHERAL FLEXCOMM0               /*!<@brief Device name: FLEXCOMM0 */
#define BOARD_ISP_FC0_TXD_SIGNAL TXD_SCL_MISO                /*!<@brief FLEXCOMM0 signal: TXD_SCL_MISO */
#define BOARD_ISP_FC0_TXD_PIN_NAME FC0_TXD_SCL_MISO          /*!<@brief Pin name */
#define BOARD_ISP_FC0_TXD_LABEL "U24[12]/P0_30-ISP_FC0_TXD"  /*!<@brief Label */
#define BOARD_ISP_FC0_TXD_NAME "ISP_FC0_TXD"                 /*!<@brief Identifier name */
#define BOARD_ISP_FC0_TXD_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M4F */

#define PIO010_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO011_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO012_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name SWDIO (coord M3), P1[2]/U22[4]/D5[5]/IF_SWDIO
  @{ */
#define BOARD_IF_SWDIO_PERIPHERAL SWD                      /*!<@brief Device name: SWD */
#define BOARD_IF_SWDIO_SIGNAL SWDIO                        /*!<@brief SWD signal: SWDIO */
#define BOARD_IF_SWDIO_PIN_NAME SWDIO                      /*!<@brief Pin name */
#define BOARD_IF_SWDIO_LABEL "P1[2]/U22[4]/D5[5]/IF_SWDIO" /*!<@brief Label */
#define BOARD_IF_SWDIO_NAME "IF_SWDIO"                     /*!<@brief Identifier name */
                                                           /* @} */

/*! @name SWCLK (coord L3), U16[4]/SWDCLK_TRGT
  @{ */
#define BOARD_SWDCLK_TRGT_PERIPHERAL SWD             /*!<@brief Device name: SWD */
#define BOARD_SWDCLK_TRGT_SIGNAL SWCLK               /*!<@brief SWD signal: SWCLK */
#define BOARD_SWDCLK_TRGT_PIN_NAME SWCLK             /*!<@brief Pin name */
#define BOARD_SWDCLK_TRGT_LABEL "U16[4]/SWDCLK_TRGT" /*!<@brief Label */
#define BOARD_SWDCLK_TRGT_NAME "SWDCLK_TRGT"         /*!<@brief Identifier name */
                                                     /* @} */

/*! @name SWO (coord P2), U16[12]/SWO_TRGT
  @{ */
#define BOARD_SWO_TRGT_PERIPHERAL SWD           /*!<@brief Device name: SWD */
#define BOARD_SWO_TRGT_SIGNAL SWO               /*!<@brief SWD signal: SWO */
#define BOARD_SWO_TRGT_PIN_NAME SWO             /*!<@brief Pin name */
#define BOARD_SWO_TRGT_LABEL "U16[12]/SWO_TRGT" /*!<@brief Label */
#define BOARD_SWO_TRGT_NAME "SWO_TRGT"          /*!<@brief Identifier name */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M4F */

