lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name LCD_VD(22) (coord A7), J16[27]/P3_8-LCD_VD22
  @{ */
#define BOARD_LCD_VD22_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_LCD_VD22_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_LCD_VD22_CHANNEL 22                    /*!<@brief LCD LCD_VD channel: 22 */
#define BOARD_LCD_VD22_PIN_NAME LCD_VD(22)           /*!<@brief Pin name */
#define BOARD_LCD_VD22_LABEL "J16[27]/P3_8-LCD_VD22" /*!<@brief Label */
#define BOARD_LCD_VD22_NAME "LCD_VD22"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name LCD_VD(23) (coord C7), J16[28]/P3_9-LCD_VD23
  @{ */
#define BOARD_LCD_VD23_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_LCD_VD23_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_LCD_VD23_CHANNEL 23                    /*!<@brief LCD LCD_VD channel: 23 */
#define BOARD_LCD_VD23_PIN_NAME LCD_VD(23)           /*!<@brief Pin name */
#define BOARD_LCD_VD23_LABEL "J16[28]/P3_9-LCD_VD23" /*!<@brief Label */
#define BOARD_LCD_VD23_NAME "LCD_VD23"               /*!<@brief Identifier name */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void); /* Function assigned for the Cortex-M4F */

#define PIO017_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT7 0x07u        /*!<@brief Selects pin function.: Alternative connection 7. */
#define PIO226_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO226_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO410_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO410_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO411_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO411_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO412_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO412_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO413_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO413_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO414_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO414_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO415_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO415_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO416_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO416_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO48_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO48_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name ENET_TXD0 (coord B14), U12[17]/JP11[1]/P4_8-ENET_TXD0
  @{ */
/*!
 * @brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL ENET
/*!
 * @brief ENET signal: ENET_TXD */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL ENET_TXD
/*!
 * @brief ENET ENET_TXD channel: 0 */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL 0
/*!
 * @brief Pin name */
#define BOARD_INITENETPINS_ENET_TXD0_PIN_NAME ENET_TXD0
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_TXD0_LABEL "U12[17]/JP11[1]/P4_8-ENET_TXD0"
/*!
 * @brief Identifier name */
#define BOARD_INITENETPINS_ENET_TXD0_NAME "ENET_TXD0"
/* @} */

/*! @name ENET_TXD1 (coord E14), U12[18]/P0_17-ENET_TXD1
  @{ */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL ENET                 /*!<@brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL ENET_TXD                 /*!<@brief ENET signal: ENET_TXD */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL 1                       /*!<@brief ENET ENET_TXD channel: 1 */
#define BOARD_INITENETPINS_ENET_TXD1_PIN_NAME ENET_TXD1              /*!<@brief Pin name */
#define BOARD_INITENETPINS_ENET_TXD1_LABEL "U12[18]/P0_17-ENET_TXD1" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_TXD1_NAME "ENET_TXD1"                /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name ENET_TX_EN (coord B6), U12[16]/P4_13-ENET_TX_EN
  @{ */
#define BOARD_INITENETPINS_ENET_TX_EN_PERIPHERAL ENET                  /*!<@brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_TX_EN_SIGNAL ENET_TX_EN                /*!<@brief ENET signal: ENET_TX_EN */
#define BOARD_INITENETPINS_ENET_TX_EN_PIN_NAME ENET_TX_EN              /*!<@brief Pin name */
#define BOARD_INITENETPINS_ENET_TX_EN_LABEL "U12[16]/P4_13-ENET_TX_EN" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_TX_EN_NAME "ENET_TX_EN"                /*!<@brief Identifier name */
                                                                       /* @} */

/*! @name ENET_RXD0 (coord A9), U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0
  @{ */
/*!
 * @brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL ENET
/*!
 * @brief ENET signal: ENET_RXD */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL ENET_RXD
/*!
 * @brief ENET ENET_RXD channel: 0 */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL 0
/*!
 * @brief Pin name */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_NAME ENET_RXD0
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_RXD0_LABEL "U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0"
/*!
 * @brief Identifier name */
#define BOARD_INITENETPINS_ENET_RXD0_NAME "ENET_RXD0"
/* @} */

