lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name ENET_RXD1 (coord A6), U12[7]/P4_12-ENET_RXD1
  @{ */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL ENET_RXD                /*!<@brief ENET signal: ENET_RXD */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL 1                      /*!<@brief ENET ENET_RXD channel: 1 */
#define BOARD_INITENETPINS_ENET_RXD1_PIN_NAME ENET_RXD1             /*!<@brief Pin name */
#define BOARD_INITENETPINS_ENET_RXD1_LABEL "U12[7]/P4_12-ENET_RXD1" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_RXD1_NAME "ENET_RXD1"               /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name ENET_RX_DV (coord B9), U12[11]/P4_10-ENET_CRS_DV
  @{ */
/*!
 * @brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_CRS_DV_PERIPHERAL ENET
/*!
 * @brief ENET signal: ENET_RX_DV */
#define BOARD_INITENETPINS_ENET_CRS_DV_SIGNAL ENET_RX_DV
/*!
 * @brief Pin name */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN_NAME ENET_RX_DV
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_CRS_DV_LABEL "U12[11]/P4_10-ENET_CRS_DV"
/*!
 * @brief Identifier name */
#define BOARD_INITENETPINS_ENET_CRS_DV_NAME "ENET_CRS_DV"
/* @} */

/*! @name ENET_MDIO (coord C4), U12[12]/P4_16-ENET_MDIO
  @{ */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL ENET                 /*!<@brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL ENET_MDIO                /*!<@brief ENET signal: ENET_MDIO */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME ENET_MDIO              /*!<@brief Pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL "U12[12]/P4_16-ENET_MDIO" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME "ENET_MDIO"                /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name ENET_MDC (coord A4), U12[13]/P4_15-ENET_MDC
  @{ */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL ENET_MDC                /*!<@brief ENET signal: ENET_MDC */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME ENET_MDC              /*!<@brief Pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL "U12[13]/P4_15-ENET_MDC" /*!<@brief Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME "ENET_MDC"                /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name PIO2_26 (coord H11), U12[15]/P2_26-ENET_PHY_RSTn
  @{ */
/*!
 * @brief Device name: GPIO */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PERIPHERAL GPIO
/*!
 * @brief GPIO signal: PIO2 */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_SIGNAL PIO2
/*!
 * @brief GPIO device name: GPIO */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_GPIO GPIO
/*!
 * @brief PIO2 pin index: 26 */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_GPIO_PIN 26U
/*!
 * @brief PORT device name: 2U */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PORT 2U
/*!
 * @brief 2U pin index: 26 */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PIN 26U
/*!
 * @brief GPIO PIO2 channel: 26 */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_CHANNEL 26
/*!
 * @brief Pin name */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PIN_NAME PIO2_26
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_LABEL "U12[15]/P2_26-ENET_PHY_RSTn"
/*!
 * @brief Identifier name */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_NAME "ENET_PHY_RSTn"
/*!
 * @brief Direction */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_DIRECTION kPIN_MUX_DirectionOutput
/* @} */

/*! @name ENET_RX_CLK (coord B5), JS18[2]/P4_14-ENET_RX_CLK
  @{ */
/*!
 * @brief Device name: ENET */
#define BOARD_INITENETPINS_ENET_RX_CLK_PERIPHERAL ENET
/*!
 * @brief ENET signal: ENET_RX_CLK */
#define BOARD_INITENETPINS_ENET_RX_CLK_SIGNAL ENET_RX_CLK
/*!
 * @brief Pin name */
#define BOARD_INITENETPINS_ENET_RX_CLK_PIN_NAME ENET_RX_CLK
/*!
 * @brief Label */
#define BOARD_INITENETPINS_ENET_RX_CLK_LABEL "JS18[2]/P4_14-ENET_RX_CLK"
/*!
 * @brief Identifier name */
#define BOARD_INITENETPINS_ENET_RX_CLK_NAME "ENET_RX_CLK"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void); /* Function assigned for the Cortex-M4F */

#define PIO12_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO13_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO13_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */

/*! @name PDM1_CLK (coord L14), J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK
  @{ */
#define BOARD_PDM1_CLK_PERIPHERAL DMIC0                               /*!<@brief Device name: DMIC0 */
#define BOARD_PDM1_CLK_SIGNAL CLK                                     /*!<@brief DMIC0 signal: CLK */
#define BOARD_PDM1_CLK_CHANNEL 1                                      /*!<@brief DMIC0 CLK channel: 1 */
#define BOARD_PDM1_CLK_PIN_NAME PDM1_CLK                              /*!<@brief Pin name */
#define BOARD_PDM1_CLK_LABEL "J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK" /*!<@brief Label */
#define BOARD_PDM1_CLK_NAME "PDM1_CLK"                                /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name PDM1_DATA (coord J13), JS26[3]/DMIC1[1]/P1_3-PDM1_DATA
  @{ */
#define BOARD_PDM1_DATA_PERIPHERAL DMIC0                        /*!<@brief Device name: DMIC0 */
#define BOARD_PDM1_DATA_SIGNAL DATA                             /*!<@brief DMIC0 signal: DATA */
#define BOARD_PDM1_DATA_CHANNEL 1                               /*!<@brief DMIC0 DATA channel: 1 */
#define BOARD_PDM1_DATA_PIN_NAME PDM1_DATA                      /*!<@brief Pin name */
#define BOARD_PDM1_DATA_LABEL "JS26[3]/DMIC1[1]/P1_3-PDM1_DATA" /*!<@brief Label */
#define BOARD_PDM1_DATA_NAME "PDM1_DATA"                        /*!<@brief Identifier name */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void); /* Function assigned for the Cortex-M4F */

#define PIO218_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO218_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO219_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO219_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO220_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO220_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO311_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO311_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO41_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO41_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO42_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO42_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO43_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO43_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */

