lichengxiang0/LPC54628_test/board/pin_mux.h
/*! @name FC6_SCK (coord G14), U10[29]/J9[14]/P4_1-FC6_I2S_TX_SCK
  @{ */
/*!
 * @brief Device name: FLEXCOMM6 */
#define BOARD_FC6_I2S_TX_SCK_PERIPHERAL FLEXCOMM6
/*!
 * @brief FLEXCOMM6 signal: SCK */
#define BOARD_FC6_I2S_TX_SCK_SIGNAL SCK
/*!
 * @brief Pin name */
#define BOARD_FC6_I2S_TX_SCK_PIN_NAME FC6_SCK
/*!
 * @brief Label */
#define BOARD_FC6_I2S_TX_SCK_LABEL "U10[29]/J9[14]/P4_1-FC6_I2S_TX_SCK"
/*!
 * @brief Identifier name */
#define BOARD_FC6_I2S_TX_SCK_NAME "FC6_I2S_TX_SCK"
/* @} */

/*! @name FC6_TXD_SCL_MISO_WS (coord F13), U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS
  @{ */
#define BOARD_FC6_I2S_TX_WS_PERIPHERAL FLEXCOMM6                      /*!<@brief Device name: FLEXCOMM6 */
#define BOARD_FC6_I2S_TX_WS_SIGNAL TXD_SCL_MISO_WS                    /*!<@brief FLEXCOMM6 signal: TXD_SCL_MISO_WS */
#define BOARD_FC6_I2S_TX_WS_PIN_NAME FC6_TXD_SCL_MISO_WS              /*!<@brief Pin name */
#define BOARD_FC6_I2S_TX_WS_LABEL "U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS" /*!<@brief Label */
#define BOARD_FC6_I2S_TX_WS_NAME "FC6_I2S_TX_WS"                      /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name FC6_RXD_SDA_MOSI_DATA (coord F14), U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA
  @{ */
/*!
 * @brief Device name: FLEXCOMM6 */
#define BOARD_FC6_I2S_TX_DATA_PERIPHERAL FLEXCOMM6
/*!
 * @brief FLEXCOMM6 signal: RXD_SDA_MOSI_DATA */
#define BOARD_FC6_I2S_TX_DATA_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Pin name */
#define BOARD_FC6_I2S_TX_DATA_PIN_NAME FC6_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_FC6_I2S_TX_DATA_LABEL "U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA"
/*!
 * @brief Identifier name */
#define BOARD_FC6_I2S_TX_DATA_NAME "FC6_I2S_TX_DATA"
/* @} */

/*! @name FC7_RXD_SDA_MOSI_DATA (coord P12), U10[31]/J9[20]/P2_19-FC7_I2S_RX_DAT
  @{ */
/*!
 * @brief Device name: FLEXCOMM7 */
#define BOARD_FC7_I2S_RX_DAT_PERIPHERAL FLEXCOMM7
/*!
 * @brief FLEXCOMM7 signal: RXD_SDA_MOSI_DATA */
#define BOARD_FC7_I2S_RX_DAT_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Pin name */
#define BOARD_FC7_I2S_RX_DAT_PIN_NAME FC7_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_FC7_I2S_RX_DAT_LABEL "U10[31]/J9[20]/P2_19-FC7_I2S_RX_DAT"
/*!
 * @brief Identifier name */
#define BOARD_FC7_I2S_RX_DAT_NAME "FC7_I2S_RX_DAT"
/* @} */

/*! @name FC7_SCK (coord N10), U10[29]/J9[16]/P2_18-FC7_I2S_RX_SCK
  @{ */
/*!
 * @brief Device name: FLEXCOMM7 */
#define BOARD_FC7_I2S_RX_SCK_PERIPHERAL FLEXCOMM7
/*!
 * @brief FLEXCOMM7 signal: SCK */
#define BOARD_FC7_I2S_RX_SCK_SIGNAL SCK
/*!
 * @brief Pin name */
#define BOARD_FC7_I2S_RX_SCK_PIN_NAME FC7_SCK
/*!
 * @brief Label */
#define BOARD_FC7_I2S_RX_SCK_LABEL "U10[29]/J9[16]/P2_18-FC7_I2S_RX_SCK"
/*!
 * @brief Identifier name */
#define BOARD_FC7_I2S_RX_SCK_NAME "FC7_I2S_RX_SCK"
/* @} */

/*! @name FC3_RTS_SCL_SSEL1 (coord P13), U10[30]/J9[18]/P2_20-FC7_I2S_RX_WS
  @{ */
#define BOARD_FC7_I2S_RX_WS_PERIPHERAL FLEXCOMM3                       /*!<@brief Device name: FLEXCOMM3 */
#define BOARD_FC7_I2S_RX_WS_SIGNAL RTS_SCL_SSEL1                       /*!<@brief FLEXCOMM3 signal: RTS_SCL_SSEL1 */
#define BOARD_FC7_I2S_RX_WS_PIN_NAME FC3_RTS_SCL_SSEL1                 /*!<@brief Pin name */
#define BOARD_FC7_I2S_RX_WS_LABEL "U10[30]/J9[18]/P2_20-FC7_I2S_RX_WS" /*!<@brief Label */
#define BOARD_FC7_I2S_RX_WS_NAME "FC7_I2S_RX_WS"                       /*!<@brief Identifier name */
                                                                       /* @} */

/*! @name MCLK (coord B2), J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO
  @{ */
#define BOARD_MCLK_PERIPHERAL SYSCON                           /*!<@brief Device name: SYSCON */
#define BOARD_MCLK_SIGNAL MCLK                                 /*!<@brief SYSCON signal: MCLK */
#define BOARD_MCLK_PIN_NAME MCLK                               /*!<@brief Pin name */
#define BOARD_MCLK_LABEL "J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO" /*!<@brief Label */
#define BOARD_MCLK_NAME "MCLK"                                 /*!<@brief Identifier name */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
